import { IconType } from "react-icons";
import { FaBook, FaHandshake, FaBan, FaBolt } from "react-icons/fa";
import { FaXTwitter } from "react-icons/fa6";
import { GiPublicSpeaker } from "react-icons/gi";
import { HiHome } from "react-icons/hi";
import { HiLightBulb } from "react-icons/hi2";
import { FaYoutube } from "react-icons/fa";
import type { AccountLink, CardData, PageInfo, QandA, SponsorList } from "./definitions";

export const ticketURL = "https://client.eventhub.jp/ticket/VjqcjZK60";
export const loginURL = "https://event.eventhub.jp/e/VjqcjZK60/login";
export const onlineTicketURL =
  "https://client.eventhub.jp/form/888f0f37-63fb-46b4-887e-f3bec9678d05/formprofile?isTicketSelected=true";

export const pageInfos: PageInfo[] = [
  {
    index: 1,
    showNavbar: false,
    showFooter: true,
    title: "Home",
    description: "",
    icon: HiHome as IconType,
    href: "/",
  },
  {
    index: 2,
    title: "スポンサー",
    showNavbar: true,
    showFooter: true,
    description:
      "TSKaigiは日本のTypeScriptコミュニティを盛り上げるカンファレンスを開催します。TSKaigiに協賛いただいた企業をご紹介します。",
    icon: FaHandshake as IconType,
    href: "/sponsor",
  },
  {
    index: 3,
    showNavbar: false,
    showFooter: true,
    title: "プロポーザル募集",
    description:
      "TSKaigiは日本のTypeScriptコミュニティを盛り上げるカンファレンスを開催します。あなたの発表・登壇をお待ちしております。ぜひ一緒に日本のTypeScriptコミュニティを盛り上げましょう！",
    icon: HiLightBulb as IconType,
    href: "/call-for-proposals",
  },
  {
    index: 4,
    title: "タイムテーブル",
    showNavbar: true,
    showFooter: true,
    description: "TSKaigiのタイムテーブルです。",
    icon: GiPublicSpeaker as IconType,
    href: "/talks",
  },
  {
    index: 5,
    title: "行動規範",
    showNavbar: true,
    showFooter: true,
    description: "TSKaigiの行動規範です。参加にあったって必ずご一読ください。",
    icon: FaBan as IconType,
    href: "/code-of-conduct",
  },
  {
    index: 6,
    title: "サブイベント",
    showNavbar: true,
    showFooter: true,
    description: "TSKaigiの公認サブイベントです",
    icon: FaBolt as IconType,
    href: "/subevents",
  },
  {
    index: 7,
    title: "特定商取引法に基づく表記",
    showNavbar: false,
    showFooter: true,
    description: "特定商取引法に基づく表記",
    icon: FaBan as IconType,
    href: "/specific-commercial",
  },
];

export const accountLink: AccountLink[] = [
  {
    index: 1,
    showNavbar: true,
    showFooter: true,
    emphasis: false,
    title: "公式X",
    description: "TSKaigiの公式X",
    icon: FaXTwitter as IconType,
    href: "https://twitter.com/tskaigi",
  },
  {
    index: 2,
    title: "Blog",
    showNavbar: true,
    showFooter: true,
    emphasis: false,
    description: "TSKaigi運営のブログ",
    icon: FaBook as IconType,
    href: "https://tskaigi.hatenablog.com/",
  },
  {
    index: 3,
    title: "公式YouTube",
    showNavbar: true,
    showFooter: true,
    emphasis: false,
    description: "TSKaigi公式のYouTubeチャンネルです、主に講演のアーカイブ動画などを公開しています",
    icon: FaYoutube as IconType,
    href: "https://www.youtube.com/@tskaigi",
  },
];

export const qaList: QandA = {
  categories: [
    {
      id: 1,
      name: "sponsor-recruitment",
      questions: [
        {
          id: 1,
          question:
            "一般社団法人TSKaigi Association はインボイス制度の適格請求書発行事業者登録ですか？",
          answer:
            "いいえ、免税事業者のため、インボイス制度の適格請求書発行事業者登録は行っておりません。",
        },
      ],
    },
    {
      id: 2,
      name: "CfP",
      questions: [
        {
          id: 101,
          question: "トークの時間はどのくらいですか？",
          answer:
            "トークはセッション30分LT5分のいずれかの枠での提案をお待ちしています。ご自身のアイデアに合った形式での提案をお願いいたします。",
        },
        {
          id: 102,
          question: "名前は本名である必要がありますか？",
          answer: "本名でもハンドルネームでも、どちらでも構いません。",
        },
        {
          id: 103,
          question: <span>トークの内容はどのようなものが望ましいですか？</span>,
          answer:
            "TypeScriptに関係する話題であること、以外に条件はありません。言語自体、ツール、ライブラリ、コミュニティ、TypeScriptで開発するシステム、開発プロセス周りの話題など、広く求めています。",
        },
        {
          id: 104,
          question: "トークの内容は高度で専門的な話である必要がありますか？",
          answer:
            "決して高度な話でなくて構いません。あなたの体験したこと、経験したことからくる提案を期待しています。",
        },
        {
          id: 105,
          question: "トーク時間が30分未満の場合でも、セッションへの応募は可能ですか？",
          answer: "はい、可能です。トーク時間は20分以上を目安としてください。",
        },
        {
          id: 106,
          question: "応募後にプロポーザルを編集できますか？",
          answer:
            "応募締切まで編集可能です。回答のコピーが応募フォームにご入力いただいたメールアドレスに送信され、メール内のリンクから編集できます。",
        },
      ],
    },
  ],
};

export const selectionCommittee: CardData[] = [
  // {
  // title: "一般社団法人TSKaigi Association",
  // subtitle: "/favicon.ico",
  // description: "サンプルテキストサンプルテキストサンプルテキストサンプルテキストサンプルテキストサンプルテキストサンプルテキストサンプルテキストサンプルテキスト",
  // logoImage: "/sponsors//logo.svg",
  // links: [
  // { icon: FaXTwitter, href: "https://twitter.com/iam_oku" },
  // { icon: FaInstagram, href: "" },
  // { icon: FaFacebookF, href: "" },
  // ]
  // },
  {
    title: "hiroppy",
    imageUrl: "/hiroppy_icon.png",
    links: [{ icon: FaXTwitter as IconType, href: "https://twitter.com/about_hiroppy" }],
  },
  {
    title: "mizchi",
    imageUrl: "https://pbs.twimg.com/profile_images/2507664307/viccruw2m1zb0xkkisil_400x400.jpeg",
    links: [{ icon: FaXTwitter as IconType, href: "https://twitter.com/mizchi" }],
  },
  {
    title: "うひょ",
    imageUrl: "https://pbs.twimg.com/profile_images/1341186424423378944/gYTKIbFl_400x400.jpg",
    links: [{ icon: FaXTwitter as IconType, href: "https://twitter.com/uhyo_" }],
  },
];

export const sponsorList: SponsorList = {
  Platinum: [
    {
      name: "レバレジーズ株式会社",
      description: `レバレジーズ株式会社では、こんなエンジニアを求めています！ピンと来たらぜひご応募ください。
・新規事業や業務改善の提案など、ビジネスからエンジニアリングまで一気通貫でやっていきたい方
・営業、マーケター、デザイナー、事業企画、データアナリストなど、あらゆる職種と協力しながら、イノベーティブなサービスを開発したい方
・「関係者全員の幸福の追求」の理念を共にした仲間と一緒に、社会貢献性の高い事業を行っていきたい方
・先制・再生医療など新しい分野も含め、多角的かつグローバルなサービスに幅広く関わりたい方
       
■ 会社紹介 	
社会の課題を解決し関係者全員の幸福を追求し続けることをミッションに、IT・医療・介護・若年層を中心とした人材事業や、Webメディア事業、M&Aコンサルティング事業など、社会貢献を軸に様々な領域でこれまで40以上のサービスを展開。2005年に創業以来、黒字経営を継続し18期目の2022年度は年商869億を突破しました。各分野のスペシャリストが集うオールインハウスの組織構成と、業界を絞らないポートフォリオ経営で、時代を代表するグローバル企業を目指します。`,
      logoImage: "/sponsors/leverages.jpg",
      logoLink: "https://recruit.leverages.jp/recruit/engineer",
      links: [
        { href: "https://leverages.jp/", text: "公式サイト" },
        {
          href: "https://recruit.leverages.jp/recruit/engineer/",
          text: "エンジニア採用",
        },
        { href: "https://tech.leverages.jp/", text: "Leverages Tech Blog" },
      ],
      addPadding: false,
    },
    {
      name: "アセンド株式会社",
      description: `■「日本で最もデジタル化の遅れた物流産業で、最高の業務体験を創る」
アセンド株式会社は日本の物流DXを目指すスタートアップです。
物流業界は20兆円の巨大市場でありながら、クラウド利用率は全産業で最低でありデジタル化の遅れ故に2024年問題をはじめとして社会課題を抱える業界です。アセンドはVertical SaaS「ロジックス」を全国の運送会社へ開発提供し、現場業務のデジタル化と経営の高度化を同時に図り、物流業界の変革を推進しています。

■ アセンドとTypeScript
アセンドは社会課題を解決するプロダクトエンジニア組織を目指して、Frontend/Backend/IaC/DataPipelineの全てをTypeScriptで統一しました。TSでの言語統一により、全エンジニアがフルスタックに開発し、顧客業務やドメインに深く寄り添いプロダクト価値に拘った開発を進めています。開発生産性は6deploys/dayと高い環境であり、少数チームでありながらサービスは案件管理や労務・車両管理といった多岐にわたる複数プロダクトを展開し、運送会社の全ての業務のデジタル化を推進しています。2023年12月にはシリーズAの資金調達を実施し、より多くの運送会社に更なる機能・価値を届けるため、仲間を募集しています。
TypeScriptを駆使して社会課題解決に挑むプロダクトエンジニアを積極募集中です。お気軽にご連絡ください！`,
      logoImage: "/sponsors/ascend.png",
      logoLink: "https://www.ascendlogi.co.jp/",
      links: [
        { href: "https://www.ascendlogi.co.jp/", text: "アセンド株式会社" },
        {
          href: "https://product.career.ascendlogi.co.jp/",
          text: "エンジニア採用サイト",
        },
        {
          href: "https://note.com/niwa_takeru/n/n0ae4acf2964d",
          text: "プロダクトエンジニアに関して",
        },
      ],
      addPadding: false,
    },
    {
      name: "株式会社ドワンゴ",
      description: `ドワンゴは "ネットの向こうの、リアルを動かす。人間らしさと、つながるデジタルを。" をコーポレートメッセージとして、学校法人角川ドワンゴ学園が運営するネットに特化した通信制高校「N高等学校・S高等学校」とオンライン学習アプリ「N予備校」、ネットの双方向性を最大限に動画や生放送に取り込んだ「ニコニコ」、ネットとリアルの融合をテーマにした巨大イベント「ニコニコ超会議」など、新しい価値を創り出し、それを事業として成立させていくことに挑戦しつづける企業です。`,
      logoImage: "/sponsors/dwango_horizontal.png",
      logoLink: "https://dwango.co.jp/",
      links: [
        { href: "https://www.nnn.ed.nico/", text: "N予備校" },
        {
          href: "https://www.nnn.ed.nico/recruit/",
          text: "N高等学校・S高等学校プロジェクト採用 | 株式会社ドワンゴ",
        },
        { href: "https://www.nicovideo.jp/", text: "ニコニコ" },
      ],
      addPadding: true,
    },
    {
      name: "Progate",
      description: `Progate は、初心者から始められるプログラミングのオンライン学習サービスである Progate や、自分の環境をつかって実務に近い開発経験を積める Progate Path といったサービスを提供しています。
Progate では、 TypeScript を自社の学習サービスの実装のために利用するだけではなく、 Progate Path の教材としても取り上げています。TypeScript は、型があるというだけではなく、型推論、タグ付き共用体とType Narrowingなどトレンドである便利なポイントをきちんと抑えており、その他にもWebサービス開発において１つのプログラミング言語でカバーができる点、学習のための資料が豊富な点などさまざまな点において教育にも良い言語だなと感じています。（もちろんその次には別の言語をつかってメモリについて教えたい気持ちはありますが！）
Progate では「Empowering everyone to open new doors through programming.」というビジョンを掲げ、プロダクトで世に価値を届けられるエンジニアを増やせるようなプロダクトを開発しています。採用も積極的におこなっていますので、お気軽にお声掛けください！
コンテンツやそれを支える技術などのお話をさせていただければと思っています。
`,
      logoImage: "/sponsors/progate_horizontal.png",
      logoLink: "https://prog-8.com/about",
      links: [
        { href: "https://www.recruit.prog-8.com/", text: "Progate採用サイト" },
        { href: "https://path.progate.com/", text: "Progate Path" },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "株式会社Helpfeel",
      description: `type TechMap = {
  TypeScript: 'Helpfeel' | 'Gyazo' | 'Scrapbox',
  React: 'Helpfeel' | 'Gyazo' | 'Scrapbox',
  Express: 'Helpfeel' | 'Scrapbox',
}
type Techs = keyof TechMap
type MessageTemplate<T extends Techs> = \`\${T}を使って\${TechMap[T]}の開発を共に取り組む仲間を募集しています\`
type Message = {
  [T in Techs]: MessageTemplate<T>
}[Techs]

株式会社Helpfeelでは、知識を届けるエンタープライズサーチ「Helpfeel」知識を磨き上げるアイディエーションツール「Scrapbox」情報を知識にするメディアキャプチャー「Gyazo」の開発運用を行なっています。全てのプロダクトでTypeScriptを使用しています。特にtoB SaaSのHelpfeelではフロントエンド・バックエンド両方にTypeScriptを採用しており、エンジニアほぼ全員がフルスタックな開発を行っています。また、Hepfeelはブラウザ上で動く独自の検索エンジンをTypeScriptで実装しています。TypeScriptが大好きな皆さん！ぜひ会場でお話ししましょう！！`,
      logoImage: "/sponsors/helpfeel_horizontal.png",
      logoLink:
        "https://scrapbox.io/helpfeel-dev-careers/%E9%96%8B%E7%99%BA%E9%83%A8_%E6%8E%A1%E7%94%A8%E6%83%85%E5%A0%B1",
      links: [
        { href: "https://twitter.com/Helpfeeltech", text: "@Helpfeel_tech" },
        {
          href: "https://blog.notainc.com/",
          text: "Helpfeel Developers' Blog",
        },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
  ],
  Gold: [
    {
      name: "Ubie株式会社",
      description: `「テクノロジーで人々を適切な医療に案内する」をミッションに掲げ、医師とエンジニアが2017年5月に創業したヘルステックスタートアップです。AIをコア技術とし、症状から適切な医療へと案内する「ユビー」と、診療の質向上を支援する医療機関向けサービスパッケージ「ユビ―メディカルナビ」等を開発・提供。誰もが自分にあった医療にアクセスできる社会づくりを進めています。
症状検索エンジン「ユビ―」は生活者の適切な医療へのかかり方をサポートする受診支援サービスです。気になる症状から関連する病名と適切な受診先を調べることができ、月間700万人以上の方々に利用いただいています。
「ユビーメディカルナビ」は問診業務効率化を図る「ユビーAI問診」や、認知向上をサポートする「ユビーリンク」などを提供しています。「ユビーAI問診」は全国47都道府県・1,700以上の医療機関で導入されております。(2024年2月現在)`,
      logoImage: "/sponsors/ubie_horizontal.png",
      logoLink: "https://ubie.life/",
      links: [
        { href: "https://ubie.life/", text: "Ubie株式会社" },
        { href: "https://ubie.app/", text: "症状検索エンジン「ユビ―」" },
        {
          href: "https://intro.dr-ubie.com/",
          text: "「ユビーメディカルナビ」",
        },
      ],
      addPadding: false,
    },
    {
      name: "株式会社ビットキー",
      description: `ビットキーは、独自開発のデジタルコネクトプラットフォームを通して、人と「暮らし」や「仕事」の間にある分断を解消するアプリ/SaaSを開発しています。 あらゆるサービスやモノを柔軟につなげることで、体験のアップデートを進めています。
この「暮らし」のサービスである「homehub」、「仕事」のサービスである「workhub」における各種WEBシステムの多くはフロントエンド、バックエンド双方TypeScriptで構築されております。
現在TypeScriptエンジニアは絶賛採用中のため、是非下記1番上のリンクからビットキーを知っていただき、ご興味あれば下記2番目のカジュアル面談をしていただければと思います！`,
      logoImage: "/sponsors/bitkey_horizontal.png",
      logoLink: "https://bitkey.co.jp/",
      links: [
        { href: "https://speakerdeck.com/bitkey/bitkey-recruiting-book", text: "企業説明資料" },
        {
          href: "https://wk87qzuwsh2.typeform.com/to/IhG1fHSj?typeform-source=qrcode-button",
          text: "カジュアル面談フォーム",
        },
        { href: "", text: "" },
      ],
      addPadding: false,
    },
    {
      name: "株式会社メドレー",
      description: `メドレーは、「医療ヘルスケアの未来をつくる」ミッションのもと、テクノロジーを活用した事業やプロジェクトを通じて、医療ヘルスケア分野の課題を解決していきます。それにより、病院や行政による「持続可能な医療」の実現と、患者さんやそのご家族にとって「納得できる医療」の実現を目指しています。
医療ヘルスケア領域の成果報酬型人材採用システム「ジョブメドレー」、オンライン動画研修サービス「ジョブメドレーアカデミー」、オンライン診療・服薬指導アプリ「CLINICS」、かかりつけ薬局支援システム「Pharms」、クラウド歯科業務支援システム「Dentis」などを運営しています。
各プロダクトでフロントエンド開発にTypeScriptを採用しており、生産性向上に寄与しています。エンジニアは得意な技術領域をベースとしつつも、チームでの開発効率を高めるために領域を越えて開発していく体制になっています。`,
      logoImage: "/sponsors/medley.png",
      logoLink: "https://www.medley.jp/",
      links: [
        { href: "https://www.medley.jp/", text: "株式会社メドレー" },
        {
          href: "https://developer.medley.jp/",
          text: "MEDLEY Developer Portal",
        },
        {
          href: "https://twitter.com/medley_dev",
          text: "メドレー ディベロッパー公式 (@medley_dev) on X",
        },
      ],
      addPadding: true,
    },
    {
      name: "株式会社タイミー",
      description: `株式会社タイミーは「『はたらく』を通じて人生の可能性を広げるインフラをつくる」をミッションに掲げ、スキマバイトアプリ「タイミー」などの事業を展開しております。
サービスリリースから約5年経過した現在、

・ユーザー数：600万人
・導入店舗数：170,000店舗
・利用企業数：66,000企業 を突破しました。

今後は、スポットワークをさらに世の中に広げることで国内の労働市場における課題を解決することを主軸としつつ、「はたらく」に留まらない多様なアプローチで、「一人ひとりの時間を豊かに」する挑戦を続けていきます。
現在のタイミーは、信頼性の高い社会インフラを目指していくという次の飛躍にむけ、システム・プロダクト・プロセス・組織を変化させていくフェーズです。
持続可能な状態でのスケールを目指しているため、変化と適応の両面を意識しエンジニアリングで課題を解決していける仲間を探しています。`,
      logoImage: "/sponsors/timee_horizontal.png",
      logoLink:
        "https://timee.notion.site/timee/Timee-Product-Org-Entrance-Book-b7380eb4f6954e29b2664fe6f5e775f9",
      links: [
        {
          href: "https://timee.notion.site/timee/Timee-Product-Org-Entrance-Book-b7380eb4f6954e29b2664fe6f5e775f9",
          text: "プロダクトエントランスブック",
        },
        {
          href: "https://productpr.timee.co.jp/m/m080509565c68/hashtag/4945140",
          text: "エンジニア向け成長支援制度の紹介",
        },
        {
          href: "https://product-recruit.timee.co.jp/",
          text: "エンジニア採用ページ",
        },
      ],
      addPadding: false,
    },
    {
      name: "トグルホールディングス株式会社",
      description: `トグルホールディングスは、「すべてのまちと、まちをつくる人たちのために」というミッションを基に、「不動産」「建築」「金融」の3つの業界をひとつの産業インフラへと統合することを目指しています。

日本の不動産業界はIT資本投資で米国の1/10に留まり、テクノロジーの活用が遅れています。 このギャップは「新しい仕組みで業界変革できる余地が多い」ということでもあり、エンジニアにとって大きなチャンスがあります。

弊社ではプロダクトのコア技術の実装にはフロントエンドからバックエンド、さらにはインフラストラクチャの定義までTypeScriptを用いています。 TypeScriptの厳密な型チェック機能をフル活用することで複雑なドメインの実装を柔軟、かつ安全に行うことを実現しています。`,
      logoImage: "/sponsors/toggle.png",
      logoLink: "https://toggle.co.jp/",
      links: [
        { href: "https://toggle.co.jp/", text: "コーポレートサイト" },
        {
          href: "https://engineer.toggle.co.jp/",
          text: "エンジニア向け ハンドブック",
        },
        { href: "https://note.com/toggle/m/md6005990812a", text: "note" },
      ],
      addPadding: false,
    },
    {
      name: "株式会社EARTHBRAIN",
      description: `EARTHBRAINは土木業界をDXするスタートアップ企業です。 土木業界は日本だけでも24兆円/年、世界では200兆円超/年の巨大な市場です。ただ、デジタル技術を用いた施工は普及しておらず”黎明期”と言えるフェーズです。 創業2年目ですが、日本だけではなく既に世界20カ国以上で使われているプロダクトを提供しているグローバルな企業です。日本から世界を変える挑戦を一緒に行いましょう！`,
      logoImage: "/sponsors/earthbrain_horizontal.png",
      logoLink: "https://www.earthbrain.com/",
      links: [
        { href: "https://www.earthbrain.com/", text: "公式企業サイト" },
        {
          href: "https://earthbrain.notion.site/EARTHBRAIN-Tech-3775fb71b41342aebf0aee6848d722bd",
          text: "エンジニア採用特設サイト",
        },
        { href: "", text: "" },
      ],
      addPadding: false,
    },
    {
      name: "グーグル・クラウド・ジャパン合同会社",
      description: `Google Cloud は、最高クラスのインフラストラクチャ、プラットフォーム、インダストリーソリューションと専門知識により、企業のデジタルトランスフォーメーション（DX）を加速します。Google の最先端技術を活用したエンタープライズグレードのソリューションを、業界で最もクリーンなクラウド上で提供しています。200 以上の国と地域のお客様が、成長を実現し、重要なビジネス上の課題を解決するための信頼できるパートナーとして、Google Cloud を利用しています。

Google Cloud Innovators は、デベロッパーや学生向けのプログラムです。イベントへの優先招待や最新情報提供などの特典があります。

Innovators Live Japan は、Googsle Cloud やデベロッパー界隈の注目トピックについて、Google社員や Innovators メンバーなどがトークするライブ配信型ウェビナーです。`,
      logoImage: "/sponsors/googlecloudjapan.png",
      logoLink:
        "https://cloud.google.com/innovators?hl=en&utm_source=events-with-google&utm_medium=et&utm_campaign=FY24-Q2-3P-TSKaigi_join&utm_content=joininnovators&utm_term=-",
      links: [
        {
          href: "https://cloud.google.com/innovators?hl=en&utm_source=events-with-google&utm_medium=et&utm_campaign=FY24-Q2-3P-TSKaigi_join&utm_content=joininnovators&utm_term=-",
          text: "Innovators プログラム",
        },
        {
          href: "https://cloudonair.withgoogle.com/events/innovators-live-jp",
          text: "Innovators Live Japan",
        },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "株式会社LayerX",
      description: `LayerXは「すべての経済活動を、デジタル化する。」をミッションに掲げるSaaS+FinTechスタートアップです。 法人支出管理サービス「バクラク」を中心に、デジタルネイティブなアセットマネジメント会社を目指す合弁会社「三井物産デジタル・アセットマネジメント」、大規模言語モデル（LLM）関連技術を活用し企業や行政における業務効率化・データ活用を支援する「AI・LLM事業」などを開発・運営しています。

LayerXは、今後のプロダクト戦略で重要なテーマとして「AI-UX（AIを前提とした利用体験）」を掲げています。そして、最高のAI-UXを作り上げるにはAI以外のソフトウェア体験の磨き込み、改善基盤の構築も重要です。
昨年策定したバクラクフロントエンドVisionでは「お客様に最高の体験を届けたい」「Webフロントエンドを楽しくしたい」という渾身の想いを込めました。ぜひ一度ご覧ください！`,
      logoImage: "/sponsors/layerx_horizontal.png",
      logoLink: "https://layerx.co.jp/",
      links: [
        {
          href: "https://comemo.nikkei.com/n/n72374ef7b2d9",
          text: "AI-UXとAX(AI Transformation)というLayerXの挑戦",
        },
        {
          href: "https://tech.layerx.co.jp/entry/2023/08/02/180000",
          text: "バクラクフロントエンド Visionの策定と願い - LayerX エンジニアブログ",
        },
        { href: "https://layerx.co.jp/jobs", text: "LayerX 採用情報" },
      ],
      addPadding: false,
    },
  ],
  Silver: [
    {
      name: "株式会社アイデミー",
      description: `「先端技術を、経済実装する。」をミッションに活動している株式会社アイデミーでは、オンラインAI/DXラーニングサービス「Aidemy」などの自社プロダクトの開発において、フロントエンドからバックエンドまで統一した言語として TypeScript を採用している「TypeScript Company」です。
Cloudflare Workers や Hono, Astro など、新しい技術を積極的に取り入れており、社内外での技術共有を行うことでエンジニアのスキルアップを支援しています。`,
      logoImage: "/sponsors/aidemy_horizontal.png",
      logoLink: "https://aidemy.co.jp/",
      links: [
        { href: "https://aidemy.co.jp/recruit/", text: "採用サイト" },
        { href: "https://zenn.dev/p/aidemy", text: "Zenn" },
        { href: "https://twitter.com/aidemytech", text: "X" },
      ],
      addPadding: true,
    },
    {
      name: "株式会社LabBase",
      description: `「研究の力を、人類の力に。」をパーパスに、研究を加速させるプラットフォームの構築を行っています。
新卒理系学生の「LabBase 就職」、中途向けの「LabBase 転職」、研究室検索サービス「LabBase 研究室サーチ」などのプロダクトをリリースし、現在研究領域のインフラとなるプロダクトの仮設検証を進めています。
Rust、TypeScriptを採用しており、特定のやり方に拘らず課題に対して最適な技術を駆使し取り組んでいただけるエンジニアを募集しております。ぜひ、カジュアル面談でお話しましょう。`,
      logoImage: "/sponsors/labbase.png",
      logoLink: "https://labbase.co.jp/engineer/",
      links: [
        { href: "https://zenn.dev/p/labbase", text: "LabBase Tech blog" },
        {
          href: "https://qiita.com/advent-calendar/2023/labbase",
          text: "LabBase Advent Calendar 2023",
        },
        {
          href: "https://note.com/labbase_corp/n/n0773704986a3",
          text: "代表取締役CEO加茂・取締役松﨑の対談記事",
        },
      ],
      addPadding: false,
    },
    {
      name: "AMDlab Inc.",
      description: `3D、CAD、BIMの技術を強みとして、建築業界のDXを推進してきたスタートアップです。
建築オンライン学習プラットフォーム「AMDhaus」、株式会社LIXILとの共同開発である、パブリックトイレ自動設計サービス「A-SPEC」の提供も行っています。
現在、建築設計クラウドサービス「DDDDbox」の開発に注力し、プロジェクトの管理、申請、建物の3Dモデリング、作図に至るまで、建築設計の全工程をウェブブラウザ上で行えるようにすることを目指して開発を進めています。開発メンバーを絶賛募集中です。`,
      logoImage: "/sponsors/amdlab.png",
      logoLink: "https://amd-lab.com/",
      links: [
        { href: "https://amd-lab.com/", text: "コーポレートサイト" },
        {
          href: "https://ddddbox.app/",
          text: "建築設計クラウドサービス DDDDbox",
        },
        {
          href: "https://a-spec.lixil.com/",
          text: "パブリックトイレ自動設計サービス A-SPEC",
        },
      ],
      addPadding: true,
    },
    {
      name: "レバテック株式会社",
      description: `レバテックは、ITエンジニアと開発組織の挑戦と成長を加速させるための採用プラットフォームです。
「日本を、IT先進国に。」というビジョンを掲げ、多角的に事業拡大を続けています。

レバテックの開発組織では、その発展を支えるために、ユーザー体験や業務プロセスを含めたアーキテクチャの見直しと、事業拡大とともに積み重なった技術的負債の解消を進めています。

フロントエンド/バックエンドともにTypescriptを使用しており、o11yやTiDBなど新しい技術も積極的に導入しています。`,
      logoImage: "/sponsors/levtech.jpg",
      logoLink:
        "https://speakerdeck.com/leverages/levtech-hui-she-shao-jie-zi-liao-enziniazhi-xiang-ke",
      links: [
        { href: "https://zenn.dev/p/levtech", text: "テックブログ" },
        {
          href: "https://speakerdeck.com/leverages/levtech-hui-she-shao-jie-zi-liao-enziniazhi-xiang-ke",
          text: "エンジニア職向け会社紹介",
        },
        { href: "https://speakerdeck.com/leveragestech", text: "登壇資料" },
      ],
      addPadding: true,
    },
    {
      name: "株式会社Linc'well",
      description: `Linc'wellは「テクノロジーを通じて、医療を一歩前へ」をミッションに掲げ、医療を効率化し患者の利便性と医療の質の向上を目指した事業展開を行っています。
オンライン・オフラインで医療従事者・患者をつなぐヘルスケアプラットフォーム事業を主力としており、「オンライン診療システム提供サービス」「クリニックDX支援サービス」「ヘルスケアECサービス」の3つのサービスを提供しています。`,
      logoImage: "/sponsors/lincwell.png",
      subLogoImage: "/sponsors/lincwell-sub.png",
      logoLink: "https://linc-well.com/",
      links: [
        { href: "https://engineer.linc-well.com", text: "採用サイト" },
        {
          href: "https://zenn.dev/p/lincwell_inc",
          text: "テックブログ",
        },
        { href: "https://note.com/lincwell", text: "note" },
      ],
      addPadding: false,
    },
    {
      name: "Micoworks株式会社",
      description: `Micoworks株式会社は、企業と顧客のコミュニケーションを最適化するマーケティングプラットフォーム「MicoCloud（ミコクラウド）」、飲食店向けLINEミニアプリサービス「ミコミー」を開発、提供しています。最適なコミュニケーションによって、ブランド価値を最大化し、あらゆるビジネスの可能性を広げます。`,
      logoImage: "/sponsors/micoworks.png",
      logoLink: "https://micoworks.jp/",
      links: [
        { href: "https://micoworks.jp/", text: "会社HP" },
        {
          href: "https://speakerdeck.com/micoworks/enziniaxiang-ke-micoworkszhu-shi-hui-she-hui-she-shuo-ming-zi-liao",
          text: "採用Deck",
        },
        {
          href: "https://herp.careers/v1/micoworksinc/requisition-groups/1102ea37-e879-4e43-88d3-0c4facf51dec",
          text: "採用ページ（求人一覧）",
        },
      ],
      addPadding: false,
    },
    {
      name: "株式会社オプティム",
      description: `OPTiMは「ネットを空気に変える」というコンセプトをもとに、AI・IoT・Cloud・Mobile・Robotics技術を土台とし、あらゆる業界のDXを実現させていく企業です。

日本No1シェアのデバイス管理サービスや、農業分野ではドローン農薬散布サービス、建設分野ではスマートフォンで簡単に測量できるサービス、AIによる契約書・電子帳簿管理サービスなどを自社開発しています。

より良いサービス提供のために、TypeScript等のさまざまな言語・ライブラリ・アルゴリズムを駆使しています。`,
      logoImage: "/sponsors/optim.png",
      logoLink:
        "https://www.optim.co.jp/?utm_source=event&utm_medium=referral&utm_campaign=TS-Kaigi",
      links: [
        {
          href: "https://www.optim.co.jp/corporate/outline",
          text: "OPTiMの事業紹介",
        },
        { href: "https://tech-blog.optim.co.jp", text: "OPTiM TECH BLOG" },
        { href: "https://www.optim.co.jp/recruit/", text: "採用情報" },
      ],
      addPadding: false,
    },
    {
      name: "合同会社DMM.com",
      description: `DMMでは、会員数4,101万人（2023年2月時点）を誇る総合サービスサイト「DMM .com」を運営しています。現在、動画配信・電子書籍・3Dプリント・web3・AIなど60以上の事業を幅広く展開し、コーポレートメッセージ「誰もが見たくなる未来。」とともに、新しい技術・サービスを追及しながら、領域を問わず挑戦を続けています。`,
      logoImage: "/sponsors/dmm_horizontal.png",
      logoLink: "https://dmm-corp.com/",
      links: [
        {
          href: "https://dmm-corp.com/recruit/engineer/1859/",
          text: "フロントエンドエンジニア（オープンポジション）",
        },
        {
          href: "https://dmm-corp.com/recruit/engineer/1860/",
          text: "フロントエンドエンジニア_テックリード（オープンポジション）",
        },
        { href: "https://twitter.com/DMMcom_tech", text: "X DMM.com Tech (@DMMcom_tech)" },
      ],
      addPadding: true,
    },
    {
      name: "チームラボ",
      description: `最新のテクノロジーを活用したデジタルソリューション、大規模なシステム開発や、プロダクト、デジタルコンテンツの制作、都市計画や建築空間設計などを行う。
アーティスト、プログラマ、エンジニア、CGアニメーター、数学者、建築家など、デジタル社会の様々な分野のスペシャリストから構成されているウルトラテクノロジスト集団で、アート、サイエンス、テクノロジー、クリエイティビティの境界を越えて、集団的創造をコンセプトに活動している。`,
      logoImage: "/sponsors/teamlab.png",
      logoLink: "https://www.team-lab.com/",
      links: [
        {
          href: "https://open.talentio.com/r/1/c/teamlab/homes/4227",
          text: "カジュアル面談の受付",
        },
        { href: "https://zenn.dev/teamlab_front", text: "チームラボ フロントエンド班Zenn" },
        { href: "https://note.team-lab.com/", text: "チームラボ採用note「解体新書」" },
      ],
      addPadding: false,
    },
    {
      name: "株式会社メディカルフォース",
      description: `「これからの産業の成長プロセスを合理化する」をビジョンに、現在は自由診療クリニック向けのオールインワンSaaSを提供しています。自由診療以外にも、今後の成長が期待されながら産業ならではの専門性・複雑性の高さから整備が行われず、今のテクノロジーの発展の恩恵が受けられていない産業は数多くあります。その中に深く入り込み、産業と共に会社としての成長を生み出すことを目指しています。
弊社のプロダクトは一貫してTypescriptを活用しており、また経営陣にエンジニアが2名おり技術的な意思決定に強い組織です。`,
      logoImage: "/sponsors/medicalforce_horizontal.png",
      logoLink: "https://corp.medical-force.com/",
      links: [
        {
          href: "https://medicalforce.notion.site/d47facf9d55c470aae6a184b85a5c326",
          text: "エントランスブック",
        },
        {
          href: "https://service.medical-force.com/",
          text: "自由診療クリニック向けオールインワンSaaS「medicalforce」",
        },
        {
          href: "https://note.com/s_hatanaka/n/n7f9561844b92",
          text: "全社で大規模スクラムを導入してみた話 - CTO畠中のnote",
        },
      ],
      addPadding: true,
    },
  ],

  "Event Platform": [
    {
      name: "株式会社EventHub",
      description: `💁‍♀️ EventHubについて
EventHubは、マーケティング、営業のためのウェビナー・カンファレンスを主軸に、展示会、学会や商談会を含む幅広いニーズで利用されているシェアNo.1イベントマーケティングプラットフォームです。

＼フルサイクルエンジニア募集中／

🧑‍💻 開発環境
サーバーサイド：Node.js, NestJS, TypeScript
フロントエンド: React.js,TypeScript,styled-components
データベース ：MySQL, Redis`,
      logoImage: "/sponsors/eventhub_horizontal.png",
      logoLink: "https://jobs.eventhub.co.jp/",
      links: [
        { href: "https://jobs.eventhub.co.jp/", text: "💁‍♀️ EventHub 採用情報" },
        { href: "https://eventhub.jp/", text: "💁‍♂️ EventHub サービスページ" },
        {
          href: "https://jobs.eventhub.co.jp/engineer",
          text: "🧑‍💻 EventHub エンジニアチーム",
        },
      ],
      addPadding: true,
    },
  ],

  Refreshment: [
    {
      name: "エムスリー株式会社",
      description: `ギークな集団だからこそ世界の医療を変えられる

医療における様々な課題を
ユニークなプロダクトで解決するからこそ
ユニークなエンジニアリング文化があるからこそ
ユニークなメンバーが集っているからこそ
世界の医療を変えていくことができる
3つのユニークを掛け合わせ、新たな世界を創造する
挑み続けるエムスリーのエンジニア組織で世界の医療の変革に
挑戦してみませんか？

突然ですが、ここで難読クイズ
これが解けたら連絡を
[1, 2, 3].map(a => {arg1: a}).join()[1]`,
      logoImage: "/sponsors/m3.png",
      logoLink: "https://jobs.m3.com/engineer/",
      links: [
        { href: "https://jobs.m3.com/engineer/", text: "エンジニア採用サイト" },
        { href: "https://twitter.com/m3_engineering", text: "公式X（旧Twitter）" },
        { href: "https://www.m3tech.blog", text: "テックブログ" },
      ],
      addPadding: false,
    },
  ],

  Coffee: [
    {
      name: "KAKEHASHI Inc.",
      description: `日本の医療システムの再構築を目指すヘルステックスタートアップ。現在、主要サービスの一つ薬局SaaS「Musubi」のユーザーは全国7000店以上（シェア10％超）に。そのほか薬局関連サービスを複数展開。Dev/Bizの垣根なく一貫してアジャイルな組織を志向。「プロダクトを介して蓄積される医療現場の膨大なリアルデータを、医療価値の向上にどう活かしていくか」という観点で、既存プロダクトの改善から新規事業まで、一人ひとりの自律的な行動によりプロジェクトを推進。ミッションは「日本の医療体験を、しなやかに」。`,
      logoImage: "/sponsors/kakehashi.png",
      logoLink: "https://www.kakehashi.life/",
      links: [
        {
          href: "https://kakehashi-dev.hatenablog.com/",
          text: "KAKEHASHI Tech Blog",
        },
        {
          href: "https://recruit.kakehashi.life/engineer",
          text: "KAKEHASHI RECRUTHING SITE",
        },
        {
          href: "https://twitter.com/kakehashi_dev",
          text: "X カケハシ技術広報(@kakehashi_dev)",
        },
      ],
      addPadding: false,
    },
  ],
  Beer: [
    {
      name: "Cloudbase株式会社",
      description: `「日本企業が世界を変える時代をつくる」というミッションのもと、日本企業からイノベーションを起こすべくクラウドセキュリティの SaaS を提供しております。
具体的にはAWS・Google Cloudなどのクラウドにおけるリスクを統合的に監視・管理するセキュリティプラットフォームです。
弊社では検出されたリスクをお客様に提供するSaaS部分では、バックエンドもフロントエンドもTypeScriptで実装されています。フルスタックにTypeScriptで開発していきたい人はぜひお話しさせてください。`,
      logoImage: "/sponsors/cloudbase.png",
      logoLink: "https://cloudbase.ink",
      links: [
        { href: "https://cloudbase.co.jp/", text: "Cloudbase株式会社" },
        {
          href: "https://levetty.notion.site/Cloudbase-Engineer-Entrance-Book-1f51dcaf9edd490e934780f526f833a3?pvs=74",
          text: "Cloudbase Engineer Entrance Book",
        },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
  ],
  Bronze: [
    {
      name: "株式会社プレイド",
      description: ``,
      logoImage: "/sponsors/plaid.png",
      logoLink: "https://plaid.co.jp/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "株式会社TOKIUM",
      description: ``,
      logoImage: "/sponsors/tokium.png",
      logoLink: "https://www.keihi.com/company/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "株式会社ROUTE06",
      description: ``,
      logoImage: "/sponsors/route06.png",
      logoLink: "https://route06.co.jp/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "株式会社Luup",
      description: ``,
      logoImage: "/sponsors/luup.png",
      logoLink: "https://luup.sc/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: false,
    },
    {
      name: "",
      description: ``,
      logoImage: "/sponsors/xxx.png",
      logoLink: "",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: true,
      draft: true,
    },
    {
      name: "株式会社AppBrew",
      description: ``,
      logoImage: "/sponsors/appbrew.png",
      logoLink: "https://appbrew.io",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "Relance",
      description: ``,
      logoImage: "/sponsors/relance.png",
      logoLink: "https://relance.jp/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: false,
    },
    {
      name: "Vue Fes Japan",
      description: ``,
      logoImage: "/sponsors/vue_fes_japan.svg",
      logoLink: "https://vuefes.jp",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "NuxtLabs Japan by ZEN Advisor",
      description: ``,
      logoImage: "/sponsors/nuxtlabs_japan.svg",
      logoLink: "https://zenadvisor.io/nuxtlabs-japan/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: false,
    },
    {
      name: "株式会社TwoGate",
      description: ``,
      logoImage: "/sponsors/twogate.svg",
      logoLink: "https://twogate.com/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: true,
    },
    {
      name: "カミナシ",
      description: ``,
      logoImage: "/sponsors/kaminashi.png",
      logoLink: "https://corp.kaminashi.jp/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: false,
    },
    {
      name: "株式会社ケップル",
      description: ``,
      logoImage: "/sponsors/kepple.svg",
      logoLink: "https://corp.kepple.co.jp/",
      links: [
        { href: "", text: "" },
        { href: "", text: "" },
        { href: "", text: "" },
      ],
      addPadding: false,
    },
  ],
};

export const SUB_EVENTS = [
  {
    title: "TSKaigi 2024 After Talk",
    description: `TSKaigi本編に引き続き、TypeScriptに関する発表の場を提供するとともに、TSKaigiコミュニティの活性化を図ることを目的としています。

TSKaigi 2024にご参加された方はもちろん、参加できなかった方、プロポーザルが惜しくも採択されなかった方も、ぜひこの機会にご参加ください。

本編の熱気に続き、セッションやLTを通してTypeScriptの知見を共有し、そして懇親会では横のつながりを深めましょう！

オフライン・オンライン問わず、皆様のご参加をスタッフ一同心よりお待ちしております。
`,
    sponsorList: ["株式会社LayerX", "株式会社Helpfeel", "アセンド株式会社"],
    tags: ["公募枠あり", "オンラインあり"],
    date: "6/4",
    day: "火",
    link: "https://layerx.connpass.com/event/318123/",
    thumbnail: "/subevent_6_4.png",
    finished: false,
  },
  {
    title: "【学生向け】来年は TSKaigi に登壇するぞ！LT会&交流会で学生エンジニアと繋がろう！",
    description: `初LT大歓迎！TS好きな学生も触ったことない学生も集まってワイワイ盛り上がろう！

カンファレンスに登壇してるエンジニアってかっこいいですよね！

でも、登壇するにはハードルが高い...そんなあなたに向けて、今回は学生限定のTSKaigiサブイベントとしてLT会を企画しました。
この機会をきっかけにし、ぜひ来年のTSKaigiではプロポーザルを出しましょう！
`,
    sponsorList: ["株式会社Progate", "エムスリー株式会社"],
    tags: ["学生向け", "公募枠あり", "オンラインあり"],
    date: "5/17",
    day: "金",
    link: "https://progate.connpass.com/event/318009/",
    thumbnail: "/subevent_5_17.png",
    finished: true,
  },
];
